#Practice-PANDAS Library

In [68]:
pwd

'/home'

In [69]:
import numpy as np
import pandas as pd

In [70]:
np.version.version

'1.15.1'

In [71]:
np.version

In [72]:
pd.version.version

AttributeError: module 'pandas' has no attribute 'version'

In [73]:
pd.version

AttributeError: module 'pandas' has no attribute 'version'

In [74]:
a = [1,2,3]
index = ['a','b','c']

In [75]:
pd.Series(data = a,index = index)

a    1
b    2
c    3
dtype: int64

In [76]:
myDict = {'1':32,'5':45}

In [77]:
pd.Series(myDict)

1    32
5    45
dtype: int64

In [78]:
series1 = pd.Series([1,2,3,4],['w','x','y','z'])

In [79]:
series1

w    1
x    2
y    3
z    4
dtype: int64

In [80]:
series2 = pd.Series([3,5,7,8],['w','a','h','y'])

In [81]:
series2

w    3
a    5
h    7
y    8
dtype: int64

In [82]:
series1+series2

a     NaN
h     NaN
w     4.0
x     NaN
y    11.0
z     NaN
dtype: float64

In [83]:
from numpy.random import randn

In [84]:
myData = randn(3,3)

In [85]:
myData

array([[-0.61754273,  0.73292978, -0.67376257],
       [-0.62707666,  0.87781868,  1.3617412 ],
       [-1.47047399,  0.15395981,  0.05277107]])

In [86]:
myDataFrame = pd.DataFrame(myData,['R1','R2','R3'],['C1','C2','C3'])

In [87]:
myDataFrame

          C1        C2        C3
R1 -0.617543  0.732930 -0.673763
R2 -0.627077  0.877819  1.361741
R3 -1.470474  0.153960  0.052771

In [88]:
myDataFrame[['C1','C2']]

          C1        C2
R1 -0.617543  0.732930
R2 -0.627077  0.877819
R3 -1.470474  0.153960

In [89]:
myDataFrame['C4'] = myDataFrame['C2'] * myDataFrame['C3']

In [90]:
myDataFrame

          C1        C2        C3        C4
R1 -0.617543  0.732930 -0.673763 -0.493821
R2 -0.627077  0.877819  1.361741  1.195362
R3 -1.470474  0.153960  0.052771  0.008125

In [91]:
myDataFrame['C5'] = myDataFrame['C2']+myDataFrame['C3']

In [92]:
myDataFrame

          C1        C2        C3        C4        C5
R1 -0.617543  0.732930 -0.673763 -0.493821  0.059167
R2 -0.627077  0.877819  1.361741  1.195362  2.239560
R3 -1.470474  0.153960  0.052771  0.008125  0.206731

In [93]:
myDataFrame.drop('C2',axis=1)

          C1        C3        C4        C5
R1 -0.617543 -0.673763 -0.493821  0.059167
R2 -0.627077  1.361741  1.195362  2.239560
R3 -1.470474  0.052771  0.008125  0.206731

In [94]:
myDataFrame

          C1        C2        C3        C4        C5
R1 -0.617543  0.732930 -0.673763 -0.493821  0.059167
R2 -0.627077  0.877819  1.361741  1.195362  2.239560
R3 -1.470474  0.153960  0.052771  0.008125  0.206731

In [95]:
myDataFrame.drop('C2',axis=1,inplace=True)

In [96]:
myDataFrame

          C1        C3        C4        C5
R1 -0.617543 -0.673763 -0.493821  0.059167
R2 -0.627077  1.361741  1.195362  2.239560
R3 -1.470474  0.052771  0.008125  0.206731

In [97]:
myDataFrame.loc['R2']

C1   -0.627077
C3    1.361741
C4    1.195362
C5    2.239560
Name: R2, dtype: float64

In [98]:
myDataFrame.iloc[1]

C1   -0.627077
C3    1.361741
C4    1.195362
C5    2.239560
Name: R2, dtype: float64

In [99]:
myDataFrame.loc[['R1','R2'],['C1','C5']]

          C1        C5
R1 -0.617543  0.059167
R2 -0.627077  2.239560

In [100]:
myDataFrame

          C1        C3        C4        C5
R1 -0.617543 -0.673763 -0.493821  0.059167
R2 -0.627077  1.361741  1.195362  2.239560
R3 -1.470474  0.052771  0.008125  0.206731

In [101]:
myDataFrame > 0

       C1     C3     C4    C5
R1  False  False  False  True
R2  False   True   True  True
R3  False   True   True  True

In [102]:
myDataFrame[myDataFrame > 0]

    C1        C3        C4        C5
R1 NaN       NaN       NaN  0.059167
R2 NaN  1.361741  1.195362  2.239560
R3 NaN  0.052771  0.008125  0.206731

# If all the values in c3 is +ve,then we will have entire table.....

#----------------------------------Important..................-------------------------------------

In [103]:
myDataFrame[myDataFrame['C3'] > 0]

          C1        C3        C4        C5
R2 -0.627077  1.361741  1.195362  2.239560
R3 -1.470474  0.052771  0.008125  0.206731

In [104]:
myDataFrame

          C1        C3        C4        C5
R1 -0.617543 -0.673763 -0.493821  0.059167
R2 -0.627077  1.361741  1.195362  2.239560
R3 -1.470474  0.052771  0.008125  0.206731

#Data Cleanup

In [105]:
data = {'me':[4,5,np.nan],'mf':[3,np.nan,np.nan],'mof':[2,3,4]}

In [106]:
df = pd.DataFrame(data)

In [107]:
df

    me   mf  mof
0  4.0  3.0    2
1  5.0  NaN    3
2  NaN  NaN    4

In [108]:
df.dropna()

    me   mf  mof
0  4.0  3.0    2

In [109]:
df.fillna(value = df['me'].mean())

    me   mf  mof
0  4.0  3.0    2
1  5.0  4.5    3
2  4.5  4.5    4

In [110]:
newData = {
    'Movies':['startwars','starwars','batman','batman','deadpool','deadpool'],
    'Viewers':['me','myf','mof','bobby','dean','sanny'],
    'Ratings':[10,7,6,9,8,5]
}

In [111]:
dfmovie = pd.DataFrame(newData)

In [112]:
dfmovie

      Movies Viewers  Ratings
0  startwars      me       10
1   starwars     myf        7
2     batman     mof        6
3     batman   bobby        9
4   deadpool    dean        8
5   deadpool   sanny        5

In [113]:
dfmovie.groupby('Movies').describe()

          Ratings
            count  mean      std   min    25%   50%    75%   max
Movies
batman        2.0   7.5  2.12132   6.0   6.75   7.5   8.25   9.0
deadpool      2.0   6.5  2.12132   5.0   5.75   6.5   7.25   8.0
startwars     1.0  10.0      NaN  10.0  10.00  10.0  10.00  10.0
starwars      1.0   7.0      NaN   7.0   7.00   7.0   7.00   7.0

#Reading and writing files

In [114]:
pwd

'/home'

In [115]:
ls

prakash/

In [116]:
cd PANDAS-Basics\(Series\).ipynb

[Errno 2] No such file or directory: 'PANDAS-Basics(Series).ipynb'
/home

In [117]:
cd ..

/

In [118]:
ls

bin/    etc/             lib/         mnt/   run/   swapfile  usr/
boot/   home/            lib64/       opt/   sbin/  sys/      var/
cdrom/  initrd.img@      lost+found/  proc/  snap/  tmp/      vmlinuz@
dev/    initrd.img.old@  media/       root/  srv/   u01/      vmlinuz.old@

In [119]:
pwd

'/'

In [120]:
cd home/

/home

In [121]:
ls

prakash/

In [122]:
ls -a

./  ../  prakash/

In [123]:
cd prakash/

/home/prakash

In [124]:
ls

anaconda3/             PANDAS-Basics(Series).ipynb  test.json
AzureToolsForEclipse/  pgadmin.log                  Untitled1.ipynb
Desktop/               Pictures/                    Untitled2.ipynb
Documents/             Pract.ipynb                  Untitled3.ipynb
Downloads/             Public/                      Untitled4.ipynb
examples.desktop       PycharmProjects/             Untitled5.ipynb
git/                   Pycharm Setting/             Untitled6.ipynb
Images/                Rails_Basic_App/             Untitled Folder/
Music/                 react_sample/                Untitled.ipynb
Numpy Basics.ipynb     snap/                        Videos/
NumpyPath.ipynb        Softwares/
package-lock.json      Templates/

In [125]:
cd Desktop/

/home/prakash/Desktop

In [126]:
ls

CodeBlocks/    Pycharm settings/
CSS4/          React-Samples/
DSA/           spring-tool-suite-3.9.6.RELEASE-e4.9.0-linux-gtk-x86_64/
Hitesh/        Statement of Accomplishment.pdf
Plan.ods       STS/
PracticeJs/    test.py
Pract-Python/

In [127]:
cd Pract-Python/

/home/prakash/Desktop/Pract-Python

In [128]:
ls

2ndmax.py        FLOW010.py      LUCKYFOUR.py     NumpyPath.html    Tables.py
Bubblesort.py    FLOW011.py      mergelist.py     Numpy.py          test.py
capitalize.py    FLOW017.py      mmm.py           PANDAS/           TLG.py
conditionals.py  FLOW018.py      nested-list.py   pattern_count.py  xor.py
doormat.py       FSQRT.py        NOidea.py        pract1.py
FCTRL2.py        identitymat.py  NumberSystem.py  __pycache__/
Fibonacci.py     List.py         Num_matrix.py    REMISS.py
FLOW007.py       loops.py        Numpy.html       Swap.py

In [129]:
cd PANDAS/

/home/prakash/Desktop/Pract-Python/PANDAS

In [130]:
ls

PANDAS-Basics(Series).html
PANDAS-Basics(Series).ipynb
Sample_Data_sets_for_Hackathon_Sarvanaam.docx
SDE1-problem+statement.pdf
series.py
Untitled spreadsheet - Sheet1.csv
Untitled spreadsheet.xlsx